[
  {
    "year": "1942",
    "event": "Act 1: The Birth of Steve Rogers\n1942: Hydra’s Attack The film cuts to 1942, in Norway, where Johann Schmidt (Red Skull), leader of the Hydra organization, is in search of the Tesseract."
  },
  {
    "year": "1986",
    "event": "The film was also released 28 years after the infamous 1986 Howard the Duck film, making Howard’s cameo a cheeky reference."
  },
  {
    "year": "1988",
    "event": "In 1988, a young Peter Quill is devastated by the death of his mother."
  },
  {
    "year": "1989",
    "event": "Prologue: Hank Pym’s Past (1989)\nWe begin in 1989 — Hank Pym, a brilliant scientist and former S.H.I.E.L.D. agent, discovers that S.H.I.E.L.D. leaders, including Howard Stark (Tony Stark’s father) and Peggy Carter, are trying to replicate his discovery — the Pym Particle, a formula that allows objects and people to shrink while increasing their density and strength."
  },
  {
    "year": "1991",
    "event": "Opening Scene:\n• Siberia, 1991:"
  },
  {
    "year": "1995",
    "event": "She’s in Los Angeles in 1995, a time period before the events of the first Avengers film."
  },
  {
    "year": "1996",
    "event": "Until 1996, after chasing money and power for a thousand years, Wenwu discovered a new ambition."
  },
  {
    "year": "1999",
    "event": "The movie opens with Tony Stark recalling an incident from New Year's Eve in 1999."
  },
  {
    "year": "2010",
    "event": "Welcome to Iron Man 2 — released in 2010 and with a lot more studio pressure."
  },
  {
    "year": "2011",
    "event": "We’re introduced to Thor (2011), directed by Kenneth Branagh."
  },
  {
    "year": "2011",
    "event": "Present Day: Steve Awakens\nSteve’s Resurrection In the year 2011, after being frozen for 70 years in the Arctic, Steve Rogers awakens in a hospital room."
  },
  {
    "year": "2012",
    "event": "Team 1 – Revisiting the Original Avengers Movie (2012)\nThis team is tasked with retrieving the Mind Stone (inside the Scepter) and the Space Stone (inside the Tesseract)."
  },
  {
    "year": "2012",
    "event": "They go back to the events of the first Avengers movie in 2012, specifically to the scene where Loki tries to take over New York City."
  },
  {
    "year": "2013",
    "event": "Team 2 – Thor: The Dark World (2013)\nThe next team, consisting of Thor and Rocket (from Guardians of the Galaxy), travels to Vormir to retrieve the Reality Stone (Aether) from the events of Thor: The Dark World."
  },
  {
    "year": "2014",
    "event": "Team 3 – Soul Stone (2014)\nThe next mission involves Black Widow and Hawkeye, who travel to Vormir to obtain the Soul Stone."
  },
  {
    "year": "2014",
    "event": "Team 4 – Guardians of the Galaxy (2014)"
  },
  {
    "year": "2014",
    "event": "Finally, Rocket and Groot go to Guardians of the Galaxy's events in 2014 to retrieve the Power Stone from Peter Quill (Star-Lord)."
  },
  {
    "year": "2017",
    "event": "2\" (2017) begins with a flashback set in Missouri on Earth in 1980."
  },
  {
    "year": "2017",
    "event": "Opening Attack on Asgard:\nThe film opens immediately after the events of Thor: Ragnarok (2017)."
  },
  {
    "year": "2018",
    "event": "Black Panther (2018) is a groundbreaking superhero film from Marvel, directed by Ryan Coogler."
  },
  {
    "year": "2018",
    "event": "Ant-Man and the Wasp is a 2018 Marvel film that centers around Scott Lang, the Ant-Man, and his team as they go on a mission involving the quantum realm."
  }
]